# Практическая работа 1. ПРИНЦИПЫ РАЗРАБОТКИ ПРОГРАММ
# Бабичев В.В.
# ИНБ-б-о-26-1

# 20. Даны hours, minutes, seconds. Переведите всё в секунды, затем обратно
# — в «часы, минуты, секунды». Выведите оба результата. Проверьте, что исходные
# значения совпали с результатом обратного перевода.

hours = 30
minutes = 20
seconds = 180

s_hours = 30 * 3600
s_minutes = 20 * 60

print(f"{hours} часов в секундах: {s_hours}, {minutes} в секундах: {s_minutes}, секунды: {seconds}")

print(f"{s_hours} обратно в часы: {s_hours // 3600}, {s_minutes} обратно в минуты: {s_minutes // 60}, секунды: {seconds}")